## Terraform Plan - `prod`

> Review carefully before approving the apply job.

```
module.compute.data.aws_ami.al2023: Reading...
module.pipeline.aws_codestarconnections_connection.github: Refreshing state... [id=arn:aws:codestar-connections:eu-west-2:753952480933:connection/f953a4da-e7a9-43c3-a787-18328387c1b6]
module.pipeline.aws_codedeploy_app.app: Refreshing state... [id=25505497-c1de-4b11-9566-d79d53f8cb68:prod-shopfast]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0abd580d81e4b3358]
module.pipeline.aws_s3_bucket.artifacts: Refreshing state... [id=prod-shopfast-pipeline-artifacts]
module.compute.aws_s3_bucket.assets: Refreshing state... [id=prod-shopfast-assets]
module.compute.data.aws_ami.al2023: Read complete after 1s [id=ami-00741a72127fa48ef]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0a8e48b1fc719ca65]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0139f94e00a563522]
module.vpc.aws_security_group.endpoints: Refreshing state... [id=sg-0b3e4507d4630dbea]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a94117b542092849]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-03d63d850a7207cf8]
module.database.aws_security_group.rds: Refreshing state... [id=sg-0f065842d3aefd47e]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-02fa4c0b4485549dd]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-036c501d95aa9500c]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f1c1006d98800e3b]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0e4714ec2a5afa020]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-00074bec3928cfa7f]
module.compute.aws_security_group.alb: Refreshing state... [id=sg-082946b31b689f977]
module.compute.aws_lb_target_group.green: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:753952480933:targetgroup/prod-tg-green/a7a3a42c7ee49af9]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f9e2daa9e8d69bf7]
module.compute.aws_lb_target_group.blue: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:753952480933:targetgroup/prod-tg-blue/d998641f2ac930c3]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0caa653ab0bdcc6c4]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-02b43eda3ad341bcd]
module.compute.aws_s3_bucket_public_access_block.assets: Refreshing state... [id=prod-shopfast-assets]
module.pipeline.aws_s3_bucket_public_access_block.artifacts: Refreshing state... [id=prod-shopfast-pipeline-artifacts]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a94117b5420928491080289494]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-03a496ef8c32907f5]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0360eff903a14ae37]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-012e3fe13860bdd52]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-030bf156f529898b8]
module.compute.aws_security_group.ec2: Refreshing state... [id=sg-02e07678d9f080df4]
module.compute.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:753952480933:loadbalancer/app/prod-alb/43f9fbb0f19420e1]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04bea2e47e40eb9d6]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-034b6f4b41ce6bea0]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0778c329757ff7136]
module.vpc.aws_vpc_endpoint.ssm: Refreshing state... [id=vpce-0298825c314145677]
module.vpc.aws_vpc_endpoint.ssm_messages: Refreshing state... [id=vpce-0fd0846585e15f8d9]
module.vpc.aws_vpc_endpoint.ec2_messages: Refreshing state... [id=vpce-074a7b4404c56a4b8]
module.database.aws_db_subnet_group.main: Refreshing state... [id=prod-db-subnet-group]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0fae00f141b0b80ba]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-00074bec3928cfa7f1080289494]
module.compute.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:753952480933:listener/app/prod-alb/43f9fbb0f19420e1/04cf54b8d4a4322f]
module.compute.aws_cloudfront_distribution.cdn: Refreshing state... [id=E224PFVMNAAXE7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute.aws_autoscaling_group.blue will be created
  + resource "aws_autoscaling_group" "blue" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 3
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 6
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = "prod-asg-blue"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = [
          + "arn:aws:elasticloadbalancing:eu-west-2:753952480933:targetgroup/prod-tg-blue/d998641f2ac930c3",
        ]
      + vpc_zone_identifier              = [
          + "subnet-02b43eda3ad341bcd",
          + "subnet-0caa653ab0bdcc6c4",
          + "subnet-0f9e2daa9e8d69bf7",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "DeploymentGroup"
          + propagate_at_launch = true
          + value               = "blue"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "prod"
        }
    }

  # module.compute.aws_autoscaling_group.green will be created
  + resource "aws_autoscaling_group" "green" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 0
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 6
      + metrics_granularity              = "1Minute"
      + min_size                         = 2
      + name                             = "prod-asg-green"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = [
          + "arn:aws:elasticloadbalancing:eu-west-2:753952480933:targetgroup/prod-tg-green/a7a3a42c7ee49af9",
        ]
      + vpc_zone_identifier              = [
          + "subnet-02b43eda3ad341bcd",
          + "subnet-0caa653ab0bdcc6c4",
          + "subnet-0f9e2daa9e8d69bf7",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "DeploymentGroup"
          + propagate_at_launch = true
          + value               = "green"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "prod"
        }
    }

  # module.compute.aws_iam_instance_profile.ec2 will be created
  + resource "aws_iam_instance_profile" "ec2" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "prod-ec2-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "prod-ec2-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.compute.aws_iam_role.ec2 will be created
  + resource "aws_iam_role" "ec2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-ec2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.compute.aws_iam_role_policy_attachment.ec2_s3 will be created
  + resource "aws_iam_role_policy_attachment" "ec2_s3" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess"
      + role       = "prod-ec2-role"
    }

  # module.compute.aws_iam_role_policy_attachment.ec2_secrets will be created
  + resource "aws_iam_role_policy_attachment" "ec2_secrets" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/SecretsManagerReadWrite"
      + role       = "prod-ec2-role"
    }

  # module.compute.aws_iam_role_policy_attachment.ec2_ssm will be created
  + resource "aws_iam_role_policy_attachment" "ec2_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "prod-ec2-role"
    }

  # module.compute.aws_launch_template.app will be created
  + resource "aws_launch_template" "app" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-00741a72127fa48ef"
      + instance_type          = "t3.medium"
      + latest_version         = (known after apply)
      + name                   = "prod-launch-template"
      + name_prefix            = (known after apply)
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKc2V0IC1lCgp5dW0gdXBkYXRlIC15Cnl1bSBpbnN0YWxsIC15IG5naW54CgojIENyZWF0ZSBoZWFsdGggY2hlY2sgZW5kcG9pbnQKbWtkaXIgLXAgL3Vzci9zaGFyZS9uZ2lueC9odG1sCmVjaG8gJ3sic3RhdHVzIjoib2sifScgPiAvdXNyL3NoYXJlL25naW54L2h0bWwvaGVhbHRoCgpzeXN0ZW1jdGwgZW5hYmxlIG5naW54CnN5c3RlbWN0bCBzdGFydCBuZ2lueAo="
      + vpc_security_group_ids = [
          + "sg-02e07678d9f080df4",
        ]

      + iam_instance_profile {
          + name = "prod-ec2-profile"
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "prod"
              + "ManagedBy"   = "terraform"
            }
        }
    }

  # module.database.aws_db_instance.db will be created
  + resource "aws_db_instance" "db" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "prod-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "prod-shopfast-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.medium"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tags_all                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + timezone                              = (known after apply)
      + username                              = "shopfast_admin"
      + vpc_security_group_ids                = [
          + "sg-0f065842d3aefd47e",
        ]
    }

  # module.pipeline.aws_codebuild_project.build will be created
  + resource "aws_codebuild_project" "build" {
      + arn                  = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 60
      + description          = (known after apply)
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "prod-shopfast-build"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 480
      + service_role         = (known after apply)
      + tags                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tags_all             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "CODEPIPELINE"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/standard:7.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = false
          + type                        = "LINUX_CONTAINER"

          + environment_variable {
              + name  = "ENV"
              + type  = "PLAINTEXT"
              + value = "prod"
            }
        }

      + source {
          + buildspec = "buildspec.yml"
          + type      = "CODEPIPELINE"
        }
    }

  # module.pipeline.aws_codedeploy_deployment_group.group will be created
  + resource "aws_codedeploy_deployment_group" "group" {
      + app_name                    = "prod-shopfast"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.AllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "prod-deployment-group"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = (known after apply)
      + tags                        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + termination_hook_enabled    = false

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout = "CONTINUE_DEPLOYMENT"
            }
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 5
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = [
                      + "arn:aws:elasticloadbalancing:eu-west-2:753952480933:listener/app/prod-alb/43f9fbb0f19420e1/04cf54b8d4a4322f",
                    ]
                }
              + target_group {
                  + name = "prod-tg-blue"
                }
              + target_group {
                  + name = "prod-tg-green"
                }
            }
        }
    }

  # module.pipeline.aws_codepipeline.pipeline will be created
  + resource "aws_codepipeline" "pipeline" {
      + arn            = (known after apply)
      + execution_mode = "SUPERSEDED"
      + id             = (known after apply)
      + name           = "prod-shopfast-pipeline"
      + pipeline_type  = "V1"
      + role_arn       = (known after apply)
      + tags           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + trigger_all    = (known after apply)

      + artifact_store {
          + location = "prod-shopfast-pipeline-artifacts"
          + type     = "S3"
        }

      + stage {
          + name = "Source"

          + action {
              + category         = "Source"
              + configuration    = {
                  + "BranchName"           = "main"
                  + "ConnectionArn"        = "arn:aws:codestar-connections:eu-west-2:753952480933:connection/f953a4da-e7a9-43c3-a787-18328387c1b6"
                  + "FullRepositoryId"     = "yourgithub/shopfast"
                  + "OutputArtifactFormat" = "CODE_ZIP"
                }
              + name             = "Source"
              + output_artifacts = [
                  + "source_output",
                ]
              + owner            = "AWS"
              + provider         = "CodeStarSourceConnection"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Build"

          + action {
              + category         = "Build"
              + configuration    = {
                  + "ProjectName" = "prod-shopfast-build"
                }
              + input_artifacts  = [
                  + "source_output",
                ]
              + name             = "Build"
              + output_artifacts = [
                  + "build_output",
                ]
              + owner            = "AWS"
              + provider         = "CodeBuild"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Deploy"

          + action {
              + category        = "Deploy"
              + configuration   = {
                  + "ApplicationName"     = "prod-shopfast"
                  + "DeploymentGroupName" = "prod-deployment-group"
                }
              + input_artifacts = [
                  + "build_output",
                ]
              + name            = "Deploy"
              + owner           = "AWS"
              + provider        = "CodeDeploy"
              + region          = (known after apply)
              + run_order       = (known after apply)
              + version         = "1"
            }
        }
    }

  # module.pipeline.aws_iam_role.pipeline will be created
  + resource "aws_iam_role" "pipeline" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codepipeline.amazonaws.com"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-pipeline-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.pipeline.aws_iam_role_policy.codestar_policy will be created
  + resource "aws_iam_role_policy" "codestar_policy" {
      + id          = (known after apply)
      + name        = "prod-codestar-connection-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "codestar-connections:UseConnection"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:codestar-connections:eu-west-2:753952480933:connection/f953a4da-e7a9-43c3-a787-18328387c1b6"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.pipeline.aws_iam_role_policy_attachment.codebuild_policy will be created
  + resource "aws_iam_role_policy_attachment" "codebuild_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeBuildAdminAccess"
      + role       = "prod-pipeline-role"
    }

  # module.pipeline.aws_iam_role_policy_attachment.codedeploy_policy will be created
  + resource "aws_iam_role_policy_attachment" "codedeploy_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployFullAccess"
      + role       = "prod-pipeline-role"
    }

  # module.pipeline.aws_iam_role_policy_attachment.pipeline_policy will be created
  + resource "aws_iam_role_policy_attachment" "pipeline_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodePipeline_FullAccess"
      + role       = "prod-pipeline-role"
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_endpoint       = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```